# core
brew "ansible"
brew "awscli"
brew "coreutils"
brew "direnv"
brew "hub"

# unix
brew "git"
brew "gnu-sed"
brew "graphviz"
brew "jq"
brew "openssl"
brew "pidof"
brew "rename"
brew "tree"
brew "watch"
brew "wdiff"
brew "wget"

brew "hivemind"
brew "overmind"
cask "ngrok"

# services
# brew "postgres"
brew "redis"

# apple
brew "mas"
brew "macvim"

# webkit
brew "qt"
cask "chromedriver"

# fonts
tap "homebrew/cask-fonts"
cask "font-inconsolata"

# Apps
cask "1Password"
#cask "Alfred"
cask "Dropbox"
cask "Fantastical"
cask "Firefox"
cask "LICEcap"
mas "Pixelmator", id: 407963104
cask "Radiant-Player"
cask "RescueTime"
cask "Slack"
cask "Sublime-Text"
cask "SuperDuper"
cask "google-chrome"
cask "iTerm2"
cask "moom"
cask "Quitter"
mas "DaisyDisk", id: 411643860
mas "Soulver", id: 413965349
cask "Dash"
mas "Skitch", id: 425955336
mas "Day One", id: 1055511498
mas "Kindle", id: 405399194
cask "Figma"
cask "Sip"

brew "diff-so-fancy"
brew "tldr"
brew "less"
