# core
brew "ansible"
brew "awscli"
brew "coreutils"
brew "direnv"
brew "hub"
brew "mr"
brew "parallel"
brew "pssh"

# unix
brew "git"
brew "gnu-sed"
brew "graphviz"
brew "jq"
brew "openssl"
brew "pidof"
brew "rename"
brew "tree"
brew "watch"
brew "wdiff"
brew "wget"
brew "xz"

# services
brew "postgres"
brew "redis"
brew "rabbitmq"

# apple
brew "mas"
brew "macvim"

# webkit
brew "qt"
brew "chromedriver"

# fonts
tap "caskroom/fonts"
cask "font-inconsolata"

# Apps
tap "caskroom/cask"
cask "1Password"
#cask "Alfred"
cask "Dropbox"
cask "Fantastical"
cask "Firefox"
cask "flash-npapi"
cask "LICEcap"
cask "OmniFocus"
mas "Pixelmator", id: 407963104
cask "Radiant-Player"
cask "RescueTime"
cask "Slack"
cask "Sublime-Text"
cask "SuperDuper"
cask "google-chrome"
cask "iTerm2"
cask "moom"
cask "Quitter"
mas "DaisyDisk", id: 411643860
mas "Soulver", id: 413965349
cask "Dash"
mas "Skitch", id: 425955336
mas "Day One", id: 1055511498
cask "Caffeine"
cask "VyprVPN"
mas "Kindle", id: 405399194

# Docker/dinghy
tap "codekitchen/dinghy"
cask "virtualbox"
cask "virtualbox-extension-pack"
brew "dinghy"
brew "docker-machine"
brew "docker-compose"
brew "docker"

brew "diff-so-fancy"
